yuplus/nxp-mcx-series/MCXE247/periph0/PERI_DMA.h
/*
** ###################################################################
**     Processors:          MCXE247VLL
**                          MCXE247VLQ
**
**     Version:             rev. 1.0, 2025-02-21
**     Build:               b250417
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2025-02-21)
**         Generated based on Rev1 Draft RM..
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 1.0
 * @date 2025-02-21
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE247VLL) || defined(CPU_MCXE247VLQ))
#include "MCXE247_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_REQUEST_SOURCE_T_)
#define DMA_REQUEST_SOURCE_T_
/*!
 * @addtogroup edma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request into DMAMUX to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDmaRequestMux0Reserved0        = 0|0x100U,    /**< Reserved0 */
    kDmaRequestMux0ENET             = 1|0x100U,    /**< ENET */
    kDmaRequestMux0LPUART0Rx        = 2|0x100U,    /**< LPUART0 Receive */
    kDmaRequestMux0LPUART0Tx        = 3|0x100U,    /**< LPUART0 Transmit */
    kDmaRequestMux0LPUART1Rx        = 4|0x100U,    /**< LPUART1 Receive */
    kDmaRequestMux0LPUART1Tx        = 5|0x100U,    /**< LPUART1 Transmit */
    kDmaRequestMux0LPUART2Rx        = 6|0x100U,    /**< LPUART2 Receive */
    kDmaRequestMux0LPUART2Tx        = 7|0x100U,    /**< LPUART2 Transmit */
    kDmaRequestMux0LPI2C1Rx         = 8|0x100U,    /**< LPI2C1 Receive */
    kDmaRequestMux0LPI2C1Tx         = 9|0x100U,    /**< LPI2C1 Transmit */
    kDmaRequestMux0FlexIOChannel0   = 10|0x100U,   /**< FLEXIO Shifter0 */
    kDmaRequestMux0FlexIOChannel1   = 11|0x100U,   /**< FLEXIO Shifter1 */
    kDmaRequestMux0FlexIOChannel2   = 12|0x100U,   /**< FLEXIO Shifter2 and SAI1 Receive */
    kDmaRequestMux0SAI1Rx           = 12|0x100U,   /**< FLEXIO Shifter2 and SAI1 Receive */
    kDmaRequestMux0FlexIOChannel3   = 13|0x100U,   /**< FLEXIO Shifter3 and SAI1 Transmit */
    kDmaRequestMux0SAI1Tx           = 13|0x100U,   /**< FLEXIO Shifter3 and SAI1 Transmit */
    kDmaRequestMux0LPSPI0Rx         = 14|0x100U,   /**< LPSPI0 Receive */
    kDmaRequestMux0LPSPI0Tx         = 15|0x100U,   /**< LPSPI0 Transmit */
    kDmaRequestMux0LPSPI1Rx         = 16|0x100U,   /**< LPSPI1 Receive */
    kDmaRequestMux0LPSPI1Tx         = 17|0x100U,   /**< LPSPI1 Transmit */
    kDmaRequestMux0LPSPI2Rx         = 18|0x100U,   /**< LPSPI2 Receive */
    kDmaRequestMux0LPSPI2Tx         = 19|0x100U,   /**< LPSPI2 Transmit */
    kDmaRequestMux0FTM1Channel0     = 20|0x100U,   /**< FTM1 C0V */
    kDmaRequestMux0FTM1Channel1     = 21|0x100U,   /**< FTM1 C1V */
    kDmaRequestMux0FTM1Channel2     = 22|0x100U,   /**< FTM1 C2V */
    kDmaRequestMux0FTM1Channel3     = 23|0x100U,   /**< FTM1 C3V */
    kDmaRequestMux0FTM1Channel4     = 24|0x100U,   /**< FTM1 C4V */
    kDmaRequestMux0FTM1Channel5     = 25|0x100U,   /**< FTM1 C5V */
    kDmaRequestMux0FTM1Channel6     = 26|0x100U,   /**< FTM1 C6V */
    kDmaRequestMux0FTM1Channel7     = 27|0x100U,   /**< FTM1 C7V */
    kDmaRequestMux0FTM2Channel0     = 28|0x100U,   /**< FTM2 C0V */
    kDmaRequestMux0FTM2Channel1     = 29|0x100U,   /**< FTM2 C1V */
    kDmaRequestMux0FTM2Channel2     = 30|0x100U,   /**< FTM2 C2V */
    kDmaRequestMux0FTM2Channel3     = 31|0x100U,   /**< FTM2 C3V */
    kDmaRequestMux0FTM2Channel4     = 32|0x100U,   /**< FTM2 C4V */
    kDmaRequestMux0FTM2Channel5     = 33|0x100U,   /**< FTM2 C5V */
    kDmaRequestMux0FTM2Channel6     = 34|0x100U,   /**< FTM2 C6V */
    kDmaRequestMux0FTM2Channel7     = 35|0x100U,   /**< FTM2 C7V */
    kDmaRequestMux0FTM0Channel0     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel1     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel2     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel3     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel4     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel5     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel6     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM0Channel7     = 36|0x100U,   /**< FTM0 C0V-C7V */
    kDmaRequestMux0FTM3Channel0     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel1     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel2     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel3     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel4     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel5     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel6     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM3Channel7     = 37|0x100U,   /**< FTM3 C0V-C7V */
    kDmaRequestMux0FTM4Channel0     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel1     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel2     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel3     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel4     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel5     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel6     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM4Channel7     = 38|0x100U,   /**< FTM4 C0V-C7V */
    kDmaRequestMux0FTM5Channel0     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel1     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel2     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel3     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel4     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel5     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel6     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM5Channel7     = 39|0x100U,   /**< FTM5 C0V-C7V */
    kDmaRequestMux0FTM6Channel0     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel1     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel2     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel3     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel4     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel5     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel6     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM6Channel7     = 40|0x100U,   /**< FTM6 C0V-C7V */
    kDmaRequestMux0FTM7Channel0     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel1     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel2     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel3     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel4     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel5     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel6     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0FTM7Channel7     = 41|0x100U,   /**< FTM7 C0V-C7V */
    kDmaRequestMux0ADC0             = 42|0x100U,   /**< ADC0 COCO */
    kDmaRequestMux0ADC1             = 43|0x100U,   /**< ADC1 COCO */
    kDmaRequestMux0LPI2C0Rx         = 44|0x100U,   /**< LPI2C0 Receive */
    kDmaRequestMux0LPI2C0Tx         = 45|0x100U,   /**< LPI2C0 Transmit */
    kDmaRequestMux0PDB              = 46|0x100U,   /**< PDB0 */
    kDmaRequestMux0PDB1             = 47|0x100U,   /**< PDB1 */
    kDmaRequestMux0CMP0             = 48|0x100U,   /**< CMP0 */
    kDmaRequestMux0PortA            = 49|0x100U,   /**< PTA PortA */
    kDmaRequestMux0PortB            = 50|0x100U,   /**< PTB PortB */
    kDmaRequestMux0PortC            = 51|0x100U,   /**< PTC PortC */
    kDmaRequestMux0PortD            = 52|0x100U,   /**< PTD PortD */
    kDmaRequestMux0PortE            = 53|0x100U,   /**< PTE PortE */
    kDmaRequestMux0FlexCAN0         = 54|0x100U,   /**< CAN0 */
    kDmaRequestMux0FlexCAN1         = 55|0x100U,   /**< CAN1 */
    kDmaRequestMux0FlexCAN2         = 56|0x100U,   /**< CAN2 */
    kDmaRequestMux0SAI0Rx           = 57|0x100U,   /**< SAI0 Receive */
    kDmaRequestMux0SAI0Tx           = 58|0x100U,   /**< SAI0 Transmit */
    kDmaRequestMux0LPTMR0           = 59|0x100U,   /**< LPTMR0 */
    kDmaRequestMux0QSPIRx           = 60|0x100U,   /**< QuadSPI Receive */
    kDmaRequestMux0QSPITx           = 61|0x100U,   /**< QuadSPI Transmit */
    kDmaRequestMux0AlwaysOn62       = 62|0x100U,   /**< DMAMUX Always Enabled slot */
    kDmaRequestMux0AlwaysOn63       = 63|0x100U,   /**< DMAMUX Always Enabled slot */
} dma_request_source_t;

/* @} */
#endif /* DMA_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


